<template>
  <div class="argeemen-area">

    <h1>PunctualCat 用户许可协议</h1>

    <h2>一、软件使用协议</h2>

    <p>本协议是用户 (自然人、法人或社会团体)与 DreamCloud 公司之间关于 “PunctualCat” 软件产品（以下简称“本软件产品”）的法律协议。一旦安装、复制或以其他方式使用本软件产品，即表示同意接受协议各项条件的约束。如果用户不同意协议的条件，请不要使用本软件产品。</p>

    <p>如果用户未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。</p>

    <h2>二、软件产品保护条款</h2>

    <p>1）本软件产品之著作权及其它知识产权等相关权利或利益（包括但不限于现已取得或未来可取得之著作权、专利权、商标权、营业秘密等）皆为 DreamCloud 公司所有。本软件产品受中华人民共和国版权法及国际版权条约和其他知识产权法及条约的保护。用户仅获得本软件产品的非排他性使用权。</p>
    <p>2）用户不得：删除本软件及其他副本上一切关于版权的信息；对本软件进行反向工程，如反汇编、反编译等；</p>
    <p>3）本软件产品以现状方式提供，DreamCloud 公司不保证本软件产品能够或不能够完全满足用户需求，在用户手册、帮助文件、使用说明书等软件文档中的介绍性内容仅供用户参考，不得理解为对用户所做的任何承诺。 DreamCloud 有限公司保留对软件版本进行升级，对功能、内容、结构、界面、运行方式等进行修改或自动更新的权利。</p>
    <p>4）为了更好地服务于用户，或为了向用户提供具有个性的信息内容的需要，本软件产品可能会收集、传播某些信息，但 DreamCloud 公司承诺不向未经授权的第三方提供此类信息，以保护用户隐私。</p>
    <p>5）使用本软件产品由用户自己承担风险，在适用法律允许的最大范围内， DreamCloud 公司在任何情况下不就因使用或不能使用本软件产品所发生的特殊的、意外的、非直接或间接的损失承担赔偿责任。即使已事先被告知该损害发生的可能性。</p>
    <p>6） DreamCloud 公司定义的信息内容包括：文字、软件、声音；本公司为用户提供的商业信息，所有这些内容受版权、商标权、和其它知识产权和所有权法律的保护。所以，用户只能在本公司授权下才能使用这些内容，而不能擅自复制、修改、编撰这些内容、或创造与内容有关的衍生产品。</p>
    <p>7）如果您未遵守本协议的任何一项条款， DreamCloud 公司有权立即终止本协议，并保留通过法律手段追究责任。</p>

    <h2>三、软件的获取</h2>

    <p>1）用户可以直接从 DreamCloud 的网站上获取本软件，也可以从得到 DreamCloud 授权的第三方获取。</p>
    <p>2）如果用户从未经 DreamCloud 授权的第三方获取本软件或与本软件名称相同的安装程序， DreamCloud 无法保证该软件能够正常使用，并对因此给用户造成的损失不予负责。</p>

    <h2>四、软件的安装与卸载</h2>

    <p>1）DreamCloud 可能为不同的终端设备开发了不同的软件版本，用户应当根据实际情况选择下载合适的版本进行安装。</p>
    <p>2）下载安装程序后，用户需要按照该程序提示的步骤正确安装。</p>
    <p>3）为提供更加优质、安全的服务，在本软件安装时 DreamCloud 可能推荐用户安装其他软件，用户可以选择安装或不安装。</p>
    <p>4）如果用户不再需要使用本软件或者需要安装新版软件，可以自行卸载。</p>

    <h2>五、软件的更新</h2>

    <p>1）为了改善用户体验、完善服务内容， DreamCloud 将不断努力开发新的服务，并为用户不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。</p>
    <p>2）为了保证本软件及服务的安全性和功能的一致性， DreamCloud 有权不经向用户特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。</p>
    <p>3）本软件新版本发布后，旧版本的软件可能无法使用。 DreamCloud 不保证旧版本软件及相应的客户服务继续可用，请用户随时核对并下载最新版本。</p>
    <p>4）用户同意， DreamCloud 可能通过公告、更新日志等方式向用户通知软件更新情况，但 DreamCloud 不需向用户特别通知。</p>

    <h2>六、免责与责任限制</h2>

    <p>1）用户理解并同意：本软件及本服务按“如是”的状态提供， DreamCloud 对本服务不作任何明示或暗示的保证，包括但不限于对本服务的可适用性、持续性等。</p>
    <p>2）用户理解并同意：在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断，因此而引发的损害及后果， DreamCloud 不承担任何责任。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、风暴等以及社会事件如战争、动乱、政府行为等。</p>
    <p>3）在适用法律允许的范围内， DreamCloud 在任何情况下（不论何种原因）均不承担如下责任：（A）任何间接的、故意的、惩罚性的、附带的、惩戒性的、特殊的或后果性的损害赔偿; （B）业务或机会损失; （C）收入损失; （D）利润损失; （E）商誉损失;（F）内容损失; 或（G）数据丢失。</p>

    <h2>七、知识产权声明</h2>

    <p>1）DreamCloud 是本软件的知识产权权利人。本软件的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护， DreamCloud 享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。</p>
    <p>2）未经 DreamCloud 或相关权利人书面同意，用户不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。</p>
    
    <h2>八、DreamCloud 公司具有对以上各项条款内容的最终解释权和修改权。如用户对 DreamCloud 公司的解释或修改有异议，应当立即停止使用本软件产品。用户继续使用本软件产品的行为将被视为对 DreamCloud 公司的解释或修改的接受。</h2>
    
    <h2>九、其他</h2>

    <p>1）用户使用本软件即视为用户已阅读并同意受本协议的约束。 DreamCloud 有权在必要时修改本协议条款。 DreamCloud 可能会以包括但不限于在相关服务页面展示、网页公告、网页提示、电子邮箱、手机短信、常规的信件传送、用户注册使用本服务的帐号管理系统内发送站内信等方式中的一种或多种，向用户送达关于本服务的各种规则、通知、提示等信息，用户可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果用户继续使用本软件，即视为用户已接受修改后的协议。如果用户不接受修改后的协议，应当停止使用本软件。用户同意，任何由于电子邮箱、手机号码、通讯地址等信息错误或其他不可归咎于 DreamCloud 的原因，导致用户未收到相关规则、通知、提示等信息的，均不影响该等信息对用户所产生的法律效力，且用户应受其约束，由此产生的一切后果及责任由用户自行承担。</p>
    <p>2）本协议签订地为中华人民共和国杭州市萧山区。</p>
    <p>3）本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
    <p>4）若用户和 DreamCloud 之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，用户同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p>
    <p>5）本协议所有条款的标题仅为阅读方便，本身并无实际含义，不能作为本协议含义解释的依据。</p>
    <p>6）本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
    <p>7）为方便阅读理解，本协议以中、英文书就，但具体协议条款内容均以本协议中文版本为准。（正文完）</p>

    <span class="float-right mt-2 mb-3"><b>DreamCloud</b></span>

  </div>
</template>

<script lang="ts">
import { Component, Emit, Inject, Model, Prop, Provide, Vue, Watch } from "vue-property-decorator";

@Component
export default class ArgeementView extends Vue {}
</script>

<style lang="scss">
@import "../assets/sass/scroll";

.argeemen-area {
  position: relative;
  padding: 30px;
  overflow: hidden;
  overflow-y: scroll;

  @include pc-fix-scrollbar-white();

  h1 {
    text-align: center;
    margin-top: 0;
  }
  h2 {
    font-size: 15px;
  }
  p {
    font-size: 13px;
    margin-bottom: 3px;
    margin-top: 3px;
  }
}
</style>


